Tekla Open API Reference for Tekla Structures 2025
ToolOptionNames Fields
The TeklaStructuresSettings.ToolOptionNames type exposes the following members.
Fields
Name | Description
All
 The all.
AnalysisNodeLinks
 The analysis node links.
AnalysisNodes
 The analysis nodes.
AnalysisParts
 The analysis parts.
ConstructionLines
 The construction lines.
CustomObjects
 The custom objects.
Cuts
 The cuts.
DirectManipulation
 The direct manipulation.
DisplaySelectionFilterDialog
 The display selection filter dialog.
Distances
 The distances.
Grid
 The grid.
GridLine
 The grid line.
Joints
 The joints.
Loads
 The loads.
ObjectsInJoints
 The objects in joints.
Parts
 The parts.
Planes
 The planes.
Points
 The points.
PourBreaks
 The pour breaks.
RebarGroup
 The rebar group.
Rebars
 The rebars.
RebarSingle
 The rebar single.
ReferenceModels
 The reference models.
Screws
 The screws.
SelectAssemblies
 The select assemblies.
SelectObjectsInAssemblies
 The select objects in assemblies.
SelectTasks
 The select tasks.
SingleScrews
 The single screws.
Surfaces
 The surfaces.
Views
 The views.
Weldings
 The weldings.
Top
See Also
Reference
TeklaStructuresSettings.ToolOptionNames Class
Tekla.Structures Namespace